load_testing/results/auth_buy/auth_buy_1k.txt
  ✓ Status is 200
  ✓ Response contains token
  ✗ Response time is less than 50ms
  ↳  99% — ✓ 237943 / ✗ 753

  checks.........................: 99.87%  595987 out of 596740
  data_received..................: 54 MB   181 kB/s
  data_sent......................: 65 MB   215 kB/s
  dropped_iterations.............: 652     2.165987/s
  http_req_blocked...............: avg=3.37µs  min=666ns    med=2.04µs max=4.12ms   p(90)=3.42µs  p(95)=4.79µs  
  http_req_connecting............: avg=310ns   min=0s       med=0s     max=500.58µs p(90)=0s      p(95)=0s      
✓ http_req_duration..............: avg=3.08ms  min=765.04µs med=2.13ms max=335.38ms p(90)=3.73ms  p(95)=5.2ms   
    { expected_response:true }...: avg=3.08ms  min=765.04µs med=2.13ms max=335.38ms p(90)=3.73ms  p(95)=5.2ms   
  http_req_failed................: 0.00%   0 out of 238696
  http_req_receiving.............: avg=35.94µs min=4.75µs   med=24.2µs max=8.11ms   p(90)=55.16µs p(95)=102.86µs
  http_req_sending...............: avg=10.92µs min=2.2µs    med=7.41µs max=3.78ms   p(90)=16.1µs  p(95)=21.5µs  
  http_req_tls_handshaking.......: avg=0s      min=0s       med=0s     max=0s       p(90)=0s      p(95)=0s      
  http_req_waiting...............: avg=3.03ms  min=741.08µs med=2.08ms max=335.36ms p(90)=3.67ms  p(95)=5.12ms  
  http_reqs......................: 238696  792.963747/s
  iteration_duration.............: avg=1s      min=1s       med=1s     max=1.35s    p(90)=1s      p(95)=1.01s   
  iterations.....................: 119348  396.481874/s
✗ slow_responses.................: 100.00% 753 out of 753
  vus............................: 1       min=1                max=571
  vus_max........................: 660     min=10               max=660